# FluidTemperature Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FluidTemperature Class
Members See Also
---
Represents the dynamic viscosity and density properties as defined at a certain temperature.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class FluidTemperature : IDisposable
```

Visual Basic
---
```text
Public Class FluidTemperature _
	Implements IDisposable
```

Visual C++
---
```text
public ref class FluidTemperature : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Plumbing..::..FluidTemperature
# See Also
FluidTemperature Members
Autodesk.Revit.DB.Plumbing Namespace